Revit 2027 API
ParameterTypeId.RebarBarDiameter Property
 "Bar Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarDiameter { get; }
Public Shared ReadOnly Property RebarBarDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarDiameter {
	ForgeTypeId^ get ();
}
static member RebarBarDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace